Phamminhphuong1995/SJTWO_PHUONG/projects/lpc40xx_freertos/l3_drivers/sources/oled.c
#include "oled.h"
#include "gpio.h"
#include "lpc40xx.h"
#include "lpc_peripherals.h"
#include "spi_lab.h"
#include "string.h"

/* -------------------- Array of char_to_display_on_oled -------------------- */
static function_pointer_oled oled_callbacksR[128] = {};

/**
 *  This function clear the entire a screen
 */
void clear() { memset(bitmap_, 0x00, sizeof(bitmap_)); }
/**
 *  This function fill the entire a screen
 */
void fill() { memset(bitmap_, 0xFF, sizeof(bitmap_)); }
/**
 * Turn on chip select
 */
void cs_oled() {
  GPIO__set_as_output(1, 22);
  GPIO__set_low(1, 22);
}
/**
 * Turn off chip select
 */
void ds_oled() {
  GPIO__set_as_output(1, 22);
  GPIO__set_high(1, 22);
}

/**
 * Initialize the SPI bus 1.
 * Set up the clock signal
 * TODO modify to take any clock signal
 * NOTE credit to Preetpal Kang for this function
 * NOTE the divider will be the clock frequency divider
 */
void oled_init() {
  // Refer to LPC User manual and setup the register bits correctly

  lpc_peripheral__turn_on_power_to(LPC_PERIPHERAL__SSP1);

  // b) Setup control registers CR0 and CR1
  LPC_SSP1->CR1 |= (1 << 1);
  LPC_SSP1->CR0 = 7; // choosing 8-bit tranfer
  // c) Setup prescalar register to be <= max_clock_mhz
  // max clk spped is 24Mhz => 0x18

  uint32_t clk_peripheral = 96 * 1000 * 1000;
  uint32_t oled_freq = 8 * 1000 * 1000;
  uint8_t divider = 2;
  while (oled_freq < (clk_peripheral / divider) && divider <= 254) {
    divider += 2;
  }
  LPC_SSP1->CPSR = divider;
}
/**
 * This function is the communication of MASTER and SLAVE
 * @param unint8 data MOSI
 * @return unint8 data MISO
 */
uint8_t SSP1__exchange_byte_lab(uint8_t data_out) {
  // Configure the Data register(DR) to send and receive data by checking the SPI peripheral status register
  LPC_SSP1->DR = data_out;

  while (LPC_SSP1->SR & (1 << 4)) {
    ; // Wait until SSP is busy
  }

  return (uint8_t)(LPC_SSP1->DR & 0xFF);
}
/**
 * Set the writing mode to horizontal  LEFT -----> RIGHT
 * NOTE below 0X20 if 00 is horizontal mode, 01 is column mode and 10 is page mode
 */
void horizontal_addr_mode() {
  /* -------------------------------------------------------------------------- */
  /* ---------------------------- Set address mode ---------------------------- */
  DC_toggle_command();
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x00);

  /* ----------------------------- Set column mode ---------------------------- */
  SSP1__exchange_byte_lab(0x21);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x7F);

  /* ---------------------------- Set page address ---------------------------- */
  SSP1__exchange_byte_lab(0x22);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x07);
  /* -------------------------------------------------------------------------- */
  /* -------------------------------------------------------------------------- */
}
/**
 * Set the writing mode to vertical  UP -----> DOWN
 * NOTE below 0X20 if 00 is horizontal mode, 01 is column mode and 10 is page mode
 * NOTE cannot use this for writing a letter from TOP to BOT. each byte go in will
 * go from TOP to BOT.
 * NOTE should only use for draw a vertical line
 */
void vertical_addr_mode() {
  /* -------------------------------------------------------------------------- */
  /* ---------------------------- Set address mode ---------------------------- */
  DC_toggle_command();
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x01);

  /* ----------------------------- Set column mode ---------------------------- */
  SSP1__exchange_byte_lab(0x21);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x7F);

  /* ---------------------------- Set page address ---------------------------- */
  SSP1__exchange_byte_lab(0x22);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x07);
  /* -------------------------------------------------------------------------- */
  /* -------------------------------------------------------------------------- */
}
// TODO complete page addressing mode
void page_addressing_mode() {
  /* ---------------------------- Set address mode ---------------------------- */
  DC_toggle_command();
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x02);

  /* ----------------------------- Set column mode ---------------------------- */
  SSP1__exchange_byte_lab(0x21);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x7F);

  /* ---------------------------- Set page address ---------------------------- */
  SSP1__exchange_byte_lab(0x22);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x07);
}
void set_page_start() {
  cs_oled();
  {
    DC_toggle_command();
    SSP1__exchange_byte_lab(0xB2);
    // SSP1__exchange_byte_lab(0x07);
  }
  ds_oled();
}
/**
 * Pannel initialization for the LED screen.
 * This init set the screen to horizontal mode
 * NOTE There still be a lot of part I take it for granted.
 * NOTE Credit to Khalil the author of the board for the majority of this part.
 * TODO reiterate the code and data sheet
 * TODO implement the power down OLED
 */
void panel_init() {

  /* ---------------------------- Set DC to command --------------------------- */
  DC_toggle_command();

  /* ----------------------------- Turn off panel ----------------------------- */
  SSP1__exchange_byte_lab(0xAE);

  /* ------------- set display clock divide ratio and ratio value ------------- */
  SSP1__exchange_byte_lab(0xD5);
  SSP1__exchange_byte_lab(0x80);

  /* ---------------------- set multiplex ratio and value --------------------- */
  SSP1__exchange_byte_lab(0xA8);
  SSP1__exchange_byte_lab(0x3F);

  /* ------------------------- Set display offset = 0 ------------------------- */
  SSP1__exchange_byte_lab(0xD3);
  SSP1__exchange_byte_lab(0x00);

  /* --------------------------- Display start line --------------------------- */
  SSP1__exchange_byte_lab(0x40);

  /* --------------------------- charge pump enable --------------------------- */
  SSP1__exchange_byte_lab(0x8D);
  SSP1__exchange_byte_lab(0x14);

  /* ------------------------ Set segman remap 128 to 0 ----------------------- */
  SSP1__exchange_byte_lab(0xA1);

  /* ------------------ Set COM output Scan direction 64 to 0 ----------------- */
  SSP1__exchange_byte_lab(0xC8);

  /* ------------------------- Set pin hardware config ------------------------ */
  SSP1__exchange_byte_lab(0xDA);
  SSP1__exchange_byte_lab(0x12);

