Phamminhphuong1995/SJTWO_PHUONG/projects/lpc40xx_freertos/l3_drivers/sources/oled.c
  /* ------------------------ Contrast control register ----------------------- */
  SSP1__exchange_byte_lab(0x81);
  SSP1__exchange_byte_lab(0xCF);

  /* -------------------------- Set pre-charge period ------------------------- */
  SSP1__exchange_byte_lab(0xD9);
  SSP1__exchange_byte_lab(0xF1);

  /* -------------------------------- Set Vcomh ------------------------------- */
  SSP1__exchange_byte_lab(0xDB);
  SSP1__exchange_byte_lab(0x40);

  // vertical_addr_mode();
  horizontal_addr_mode();

  /* -------------------------- Enable entire display ------------------------- */
  SSP1__exchange_byte_lab(0xA4);

  /* ---------------------- Set  display to normal colors --------------------- */
  SSP1__exchange_byte_lab(0xA6);

  /* ----------------------------- Set display On ----------------------------- */
  SSP1__exchange_byte_lab(0xAF);
}

/**
 * Set the horizontal_mode first before fill the entire a screen
 * with either 0xFF or 0x00
 * NOTE the value from bitmap_ is set by CLEAR() and FILL()
 * NOTE credit to Khalil for the idea of this function
 */
void update() {
  // horizontal_addr_mode();
  new_line(0x00);
  for (int row = 0; row < 8; row++) {
    for (int column = 0; column < 128; column++) {
      DC_toggle_data();
      SSP1__exchange_byte_lab(bitmap_[row][column]);
    }
  }
}

/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/*    CODE FOR EVERY CHARACTER USING HEX VALUE TO MODIFY EVERY SINGLE PIXEL   */
/* -------------------------------------------------------------------------- */

void set_up_char_array() {
  oled_callbacksR[(int)'A'] = char_A;
  oled_callbacksR[(int)'B'] = char_B;
  oled_callbacksR[(int)'C'] = char_C;
  oled_callbacksR[(int)'D'] = char_D;
  oled_callbacksR[(int)'E'] = char_E;
  oled_callbacksR[(int)'F'] = char_F;
  oled_callbacksR[(int)'G'] = char_G;
  oled_callbacksR[(int)'H'] = char_H;
  oled_callbacksR[(int)'I'] = char_I;
  oled_callbacksR[(int)'J'] = char_J;
  oled_callbacksR[(int)'K'] = char_K;
  oled_callbacksR[(int)'L'] = char_L;
  oled_callbacksR[(int)'M'] = char_M;
  oled_callbacksR[(int)'N'] = char_N;
  oled_callbacksR[(int)'O'] = char_O;
  oled_callbacksR[(int)'P'] = char_P;
  oled_callbacksR[(int)'P'] = char_P;
  oled_callbacksR[(int)'Q'] = char_Q;
  oled_callbacksR[(int)'R'] = char_R;
  oled_callbacksR[(int)'S'] = char_S;
  oled_callbacksR[(int)'T'] = char_T;
  oled_callbacksR[(int)'U'] = char_U;
  oled_callbacksR[(int)'V'] = char_V;
  oled_callbacksR[(int)'W'] = char_W;
  oled_callbacksR[(int)'X'] = char_X;
  oled_callbacksR[(int)'Y'] = char_Y;
  oled_callbacksR[(int)'Z'] = char_Z;
  oled_callbacksR[(int)'a'] = char_a;
  oled_callbacksR[(int)'b'] = char_b;
  oled_callbacksR[(int)'c'] = char_c;
  oled_callbacksR[(int)'d'] = char_d;
  oled_callbacksR[(int)'e'] = char_e;
  oled_callbacksR[(int)'f'] = char_f;
  oled_callbacksR[(int)'g'] = char_g;
  oled_callbacksR[(int)'h'] = char_h;
  oled_callbacksR[(int)'i'] = char_i;
  oled_callbacksR[(int)'j'] = char_j;
  oled_callbacksR[(int)'k'] = char_k;
  oled_callbacksR[(int)'l'] = char_l;
  oled_callbacksR[(int)'m'] = char_m;
  oled_callbacksR[(int)'n'] = char_n;
  oled_callbacksR[(int)'o'] = char_o;
  oled_callbacksR[(int)'p'] = char_p;
  oled_callbacksR[(int)'q'] = char_q;
  oled_callbacksR[(int)'r'] = char_r;
  oled_callbacksR[(int)'s'] = char_s;
  oled_callbacksR[(int)'t'] = char_t;
  oled_callbacksR[(int)'u'] = char_u;
  oled_callbacksR[(int)'v'] = char_v;
  oled_callbacksR[(int)'w'] = char_w;
  oled_callbacksR[(int)'x'] = char_x;
  oled_callbacksR[(int)'y'] = char_y;
  oled_callbacksR[(int)'z'] = char_z;

  oled_callbacksR[(int)'0'] = char_0;
  oled_callbacksR[(int)'1'] = char_1;
  oled_callbacksR[(int)'2'] = char_2;
  oled_callbacksR[(int)'3'] = char_3;
  oled_callbacksR[(int)'4'] = char_4;
  oled_callbacksR[(int)'5'] = char_5;
  oled_callbacksR[(int)'6'] = char_6;
  oled_callbacksR[(int)'7'] = char_7;
  oled_callbacksR[(int)'8'] = char_8;
  oled_callbacksR[(int)'9'] = char_9;

  oled_callbacksR[(int)'"'] = char_dquote;
  oled_callbacksR[(int)'\''] = char_squote;
  oled_callbacksR[(int)','] = char_comma;
  oled_callbacksR[(int)'?'] = char_qmark;
  oled_callbacksR[(int)'!'] = char_excl;
  oled_callbacksR[(int)'@'] = char_at;
  oled_callbacksR[(int)'_'] = char_undersc;
  oled_callbacksR[(int)'*'] = char_star;
  oled_callbacksR[(int)'#'] = char_hash;
  oled_callbacksR[(int)'%'] = char_percent;

  oled_callbacksR[(int)'&'] = char_amper;
  oled_callbacksR[(int)'('] = char_parenthL;
  oled_callbacksR[(int)')'] = char_parenthR;
  oled_callbacksR[(int)'+'] = char_plus;
  oled_callbacksR[(int)'-'] = char_minus;
  oled_callbacksR[(int)'/'] = char_div;
  oled_callbacksR[(int)':'] = char_colon;
  oled_callbacksR[(int)';'] = char_scolon;
  oled_callbacksR[(int)'<'] = char_less;
  oled_callbacksR[(int)'>'] = char_greater;

  oled_callbacksR[(int)'='] = char_equal;
  oled_callbacksR[(int)'['] = char_bracketL;
  oled_callbacksR[(int)'\\'] = char_backslash;
  oled_callbacksR[(int)']'] = char_bracketR;
  oled_callbacksR[(int)'^'] = char_caret;
  oled_callbacksR[(int)'`'] = char_bquote;
  oled_callbacksR[(int)'{'] = char_braceL;
  oled_callbacksR[(int)'}'] = char_braceR;
  oled_callbacksR[(int)'|'] = char_bar;
  oled_callbacksR[(int)'~'] = char_tilde;

  oled_callbacksR[(int)' '] = char_space;
  oled_callbacksR[(int)'.'] = char_period;
  oled_callbacksR[(int)'$'] = char_dollar;
}

void char_A() {
  SSP1__exchange_byte_lab(0x7E);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x7E);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_B() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x36);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_C() {
  SSP1__exchange_byte_lab(0x3E);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x22);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_D() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x3E);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_E() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_F() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_G() {
  SSP1__exchange_byte_lab(0x3E);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x3A);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_H() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_I() {
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_J() {
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x3F);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_K() {
  SSP1__exchange_byte_lab(0x7f);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x14);
  SSP1__exchange_byte_lab(0x22);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_L() {
  SSP1__exchange_byte_lab(0x7f);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_M() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x02);
  SSP1__exchange_byte_lab(0x0C);
  SSP1__exchange_byte_lab(0x02);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_N() {
  SSP1__exchange_byte_lab(0x7f);
  SSP1__exchange_byte_lab(0x02);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x7f);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_O() {
  SSP1__exchange_byte_lab(0x3e);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x3e);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_P() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x06);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_Q() {
  SSP1__exchange_byte_lab(0x3E);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x51);
  SSP1__exchange_byte_lab(0x21);
  SSP1__exchange_byte_lab(0x5E);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_R() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x19);
  SSP1__exchange_byte_lab(0x29);
  SSP1__exchange_byte_lab(0x46);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_S() {
  SSP1__exchange_byte_lab(0x26);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x32);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_T() {
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_U() {
  SSP1__exchange_byte_lab(0x3F);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x3F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_V() {
  SSP1__exchange_byte_lab(0x1F);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x1F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_W() {
  SSP1__exchange_byte_lab(0x3F);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x3F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

