Phamminhphuong1995/SJTWO_PHUONG/projects/lpc40xx_freertos/l3_drivers/sources/oled.c
void char_X() {
  SSP1__exchange_byte_lab(0x63);
  SSP1__exchange_byte_lab(0x14);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x14);
  SSP1__exchange_byte_lab(0x63);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_Y() {
  SSP1__exchange_byte_lab(0x07);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x70);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x07);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_Z() {
  SSP1__exchange_byte_lab(0x61);
  SSP1__exchange_byte_lab(0x51);
  SSP1__exchange_byte_lab(0x49);
  SSP1__exchange_byte_lab(0x45);
  SSP1__exchange_byte_lab(0x43);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_a() {
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x78);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_b() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_c() {
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_d() {
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_e() {
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x18);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_f() {
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x7E);
  SSP1__exchange_byte_lab(0x09);
  SSP1__exchange_byte_lab(0x01);
  SSP1__exchange_byte_lab(0x02);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_g() {
  SSP1__exchange_byte_lab(0x18);
  SSP1__exchange_byte_lab(0xA4);
  SSP1__exchange_byte_lab(0xA4);
  SSP1__exchange_byte_lab(0xA4);
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_h() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x78);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_i() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x7D);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_j() {
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x80);
  SSP1__exchange_byte_lab(0x80);
  SSP1__exchange_byte_lab(0x84);
  SSP1__exchange_byte_lab(0x7D);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_k() {
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x10);
  SSP1__exchange_byte_lab(0x28);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_l() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x41);
  SSP1__exchange_byte_lab(0x7F);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_m() {
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x18);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x78);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_n() {
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x78);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_o() {
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x38);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_p() {
  SSP1__exchange_byte_lab(0xFC);
  SSP1__exchange_byte_lab(0x24);
  SSP1__exchange_byte_lab(0x24);
  SSP1__exchange_byte_lab(0x24);
  SSP1__exchange_byte_lab(0x18);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_q() {
  SSP1__exchange_byte_lab(0x18);
  SSP1__exchange_byte_lab(0x24);
  SSP1__exchange_byte_lab(0x24);
  SSP1__exchange_byte_lab(0x28);
  SSP1__exchange_byte_lab(0xFC);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_r() {
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x08);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_s() {
  SSP1__exchange_byte_lab(0x48);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_t() {
  SSP1__exchange_byte_lab(0x04);
  SSP1__exchange_byte_lab(0x3E);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_u() {
  SSP1__exchange_byte_lab(0x3C);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_v() {
  SSP1__exchange_byte_lab(0x1C);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x20);
  SSP1__exchange_byte_lab(0x1C);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

void char_w() {
  SSP1__exchange_byte_lab(0x3c);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x30);
  SSP1__exchange_byte_lab(0x40);
  SSP1__exchange_byte_lab(0x3C);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_x() {
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x28);
  SSP1__exchange_byte_lab(0x10);
  SSP1__exchange_byte_lab(0x28);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_y() {
  SSP1__exchange_byte_lab(0x9C);
  SSP1__exchange_byte_lab(0xA0);
  SSP1__exchange_byte_lab(0xA0);
  SSP1__exchange_byte_lab(0xA0);
  SSP1__exchange_byte_lab(0x7C);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_z() {
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x64);
  SSP1__exchange_byte_lab(0x54);
  SSP1__exchange_byte_lab(0x4C);
  SSP1__exchange_byte_lab(0x44);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}

