Phamminhphuong1995/SJTWO_PHUONG/projects/lpc40xx_freertos/l3_drivers/sources/oled.c
/*Danish's contribution*/
void char_0() {
  SSP1__exchange_byte_lab(0b00111110);
  SSP1__exchange_byte_lab(0b01010001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01000101);
  SSP1__exchange_byte_lab(0b00111110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_1() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01000010);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0b01000000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_2() {
  SSP1__exchange_byte_lab(0b01000010);
  SSP1__exchange_byte_lab(0b01100001);
  SSP1__exchange_byte_lab(0b01010001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01000110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_3() {
  SSP1__exchange_byte_lab(0b00100010);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_4() {
  SSP1__exchange_byte_lab(0b00011000);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00010010);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0b00010000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_5() {
  SSP1__exchange_byte_lab(0b00100111);
  SSP1__exchange_byte_lab(0b01000101);
  SSP1__exchange_byte_lab(0b01000101);
  SSP1__exchange_byte_lab(0b01000101);
  SSP1__exchange_byte_lab(0b00111001);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_6() {
  SSP1__exchange_byte_lab(0b00111100);
  SSP1__exchange_byte_lab(0b01001010);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b00110000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_7() {
  SSP1__exchange_byte_lab(0b00000001);
  SSP1__exchange_byte_lab(0b01110001);
  SSP1__exchange_byte_lab(0b00001001);
  SSP1__exchange_byte_lab(0b00000101);
  SSP1__exchange_byte_lab(0b00000011);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_8() {
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_9() {
  SSP1__exchange_byte_lab(0b00000110);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b00101001);
  SSP1__exchange_byte_lab(0b00011110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_dquote() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00000111);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00000111);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_squote() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00000101);
  SSP1__exchange_byte_lab(0b00000011);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_comma() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b10100000);
  SSP1__exchange_byte_lab(0b01100000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_qmark() {
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0b00000001);
  SSP1__exchange_byte_lab(0b01010001);
  SSP1__exchange_byte_lab(0b00001001);
  SSP1__exchange_byte_lab(0b00000110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_excl() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01011111);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_at() {
  SSP1__exchange_byte_lab(0b00110010);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01111001);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b00111110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_undersc() {
  SSP1__exchange_byte_lab(0b10000000);
  SSP1__exchange_byte_lab(0b10000000);
  SSP1__exchange_byte_lab(0b10000000);
  SSP1__exchange_byte_lab(0b10000000);
  SSP1__exchange_byte_lab(0b10000000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_star() {
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00111110);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_hash() {
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_percent() {
  SSP1__exchange_byte_lab(0b00100011);
  SSP1__exchange_byte_lab(0b00010011);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b01100100);
  SSP1__exchange_byte_lab(0b01100010);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_amper() {
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0b01001001);
  SSP1__exchange_byte_lab(0b01010101);
  SSP1__exchange_byte_lab(0b00100010);
  SSP1__exchange_byte_lab(0b01010000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_parenthL() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00011100);
  SSP1__exchange_byte_lab(0b00100010);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_parenthR() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b00100010);
  SSP1__exchange_byte_lab(0b00011100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_plus() {
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00111110);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_minus() {
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_div() {
  SSP1__exchange_byte_lab(0b00100000);
  SSP1__exchange_byte_lab(0b00010000);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_colon() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_scolon() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01010110);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_less() {
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00100010);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_greater() {
  SSP1__exchange_byte_lab(0b10000010);
  SSP1__exchange_byte_lab(0b01000100);
  SSP1__exchange_byte_lab(0b00101000);
  SSP1__exchange_byte_lab(0b00010000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_equal() {
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0b00010100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_bracketL() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_backslash() {
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00010000);
  SSP1__exchange_byte_lab(0b00100000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_bracketR() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_caret() {
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0b00000001);
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_bquote() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00000001);
  SSP1__exchange_byte_lab(0b00000010);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_braceL() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_braceR() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01000001);
  SSP1__exchange_byte_lab(0b00110110);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_bar() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01111111);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_tilde() {
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0b00001000);
  SSP1__exchange_byte_lab(0b00000100);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_space() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_period() {
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0b01100000);
  SSP1__exchange_byte_lab(0b01100000);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
void char_dollar() {
  SSP1__exchange_byte_lab(0b00100100);
  SSP1__exchange_byte_lab(0b00101010);
  SSP1__exchange_byte_lab(0b01101011);
  SSP1__exchange_byte_lab(0b00101010);
  SSP1__exchange_byte_lab(0b00010010);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
  SSP1__exchange_byte_lab(0x00);
}
/* -------------------------------------------------------------------------- */
/*                          END OF DEFINING CHARACTER                         */
/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

/**
 * configure the SJTWO board pin to:
 * P0_7 is SCLK1
 * P0_9 is MOSI
 * P1_26 is DC_ // Multiplexing between data and command
 * all the pin are output
 */
void configure_oled_PIN() {
  gpio__construct_with_function(0, 7, GPIO__FUNCTION_2);
  GPIO__set_as_output(0, 7);
  gpio__construct_with_function(0, 9, GPIO__FUNCTION_2);
  GPIO__set_as_output(0, 9);
  gpio__construct_with_function(1, 25, GPIO__FUNCITON_0_IO_PIN);
  GPIO__set_as_output(1, 25);
}

/**
 * Function toggle P1_25 for COMMAND
 */
void DC_toggle_command() { GPIO__set_low(1, 25); }
/**
 * Function toggle P1_25 for DATA
 */
void DC_toggle_data() { GPIO__set_high(1, 25); }

/**
 * scroll the content on the screen from LEFT ----> RIGHT
 */
void horizontal_scrolling() {
  cs_oled();
  {
    DC_toggle_command();
    SSP1__exchange_byte_lab(0x26);
    SSP1__exchange_byte_lab(0x00); // dummy byte
    SSP1__exchange_byte_lab(0x01); // start Page 0
    SSP1__exchange_byte_lab(0x07); // 5 frames
    SSP1__exchange_byte_lab(0x01); // end Page 7
    SSP1__exchange_byte_lab(0x00); // dummy byte 00
    SSP1__exchange_byte_lab(0xFF); // dummy byte FF
    SSP1__exchange_byte_lab(0x2F); // activate scrolling
  }
  ds_oled();
}

void new_line(uint8_t address) {
  // fprintf(stderr, "in new line\n");
  DC_toggle_command();
  SSP1__exchange_byte_lab(0xB0 | address);
  // fprintf(stderr, "set column\n");
  SSP1__exchange_byte_lab(0x10);
  SSP1__exchange_byte_lab(0x00);
  DC_toggle_data();
}
/**
 * Setting up the function_callback to the array oled_callbacksR
 * NOTE this fuction use int casting to get the ASCII value of the char
 * then using it to set as index in the array
 */
// void set_up_char_array() {
//   oled_callbacksR[(int)'A'] = char_A;
//   oled_callbacksR[(int)'C'] = char_C;
//   oled_callbacksR[(int)'M'] = char_M;
//   oled_callbacksR[(int)'P'] = char_P;
//   oled_callbacksR[(int)'E'] = char_E;
//   oled_callbacksR[(int)'M'] = char_M;
//   oled_callbacksR[(int)'I'] = char_I;
//   oled_callbacksR[(int)'L'] = char_L;
//   oled_callbacksR[(int)'U'] = char_U;
//   oled_callbacksR[(int)'V'] = char_V;
//   oled_callbacksR[(int)' '] = char_space;
//   oled_callbacksR[(int)'O'] = char_O_letter;
//   oled_callbacksR[(int)'1'] = char_1;
//   oled_callbacksR[(int)'4'] = char_4;
//   oled_callbacksR[(int)'6'] = char_6;
// }

/**
 * This function take into a char pointer
 * Looping through every character
 * Getting the function callback at oled_callbacksR array using ASCII value
 * And using the point to execute them
 */
uint8_t cursor;
void display(char *str) {
  cs_oled();
  {
    DC_toggle_data();
    for (int i = 0; i < strlen(str); i++) {
      // fprintf(stderr, "before crash\n");
      // if (str[i] == '\0') {
      //   break;
      // }
      if (str[i] == '\n') {
        cursor++;
        new_line(cursor);
        continue;
      }
      function_pointer_oled oled_handler = oled_callbacksR[(int)(str[i])];
      oled_handler();
    }
    ds_oled();
  }
}
/**
 * The sequence to turn on and  Initialize the OLED
 */
void turn_on_oled() {
  configure_oled_PIN();
  oled_init();
  clear();   // fill up the bit map with 0x00
  cs_oled(); // turn on chip select to start the PANEL initialization
  {
    panel_init();        // initializa the OLED panel
    set_up_char_array(); // set the array of character
    update();            // update the screen with all 0xFF
  }
  ds_oled(); // turn off chip select
}